In [12]:
import pandas as pd
import numpy as np
import random

In [3]:
# dataframe == shcema(db, table)

In [4]:
# dataframe을 만드는 방법
# 1. 외부파일을 읽어온다.(csv, xlsx)
# 2. 데이터구조를 가지고 dataframe을 만들어 주면 된다.
#    dic, list

In [5]:
# 항목명1  항목명2  항목명3  ==> dic(key)
# -------------------------
# 100      200      300      ==> dic(val, list)
# 200      220      330

# {"항목명1" : [100,200], "항목명2" : [200, 220]}

In [8]:
df = pd.DataFrame({"name" : ['홍길동', '박길동'],
             "age" : [100, 30],
             "ex" : [1, 2]})
df

  name  age  ex
0  홍길동  100   1
1  박길동   30   2

In [9]:
df['age']

0    100
1     30
Name: age, dtype: int64

In [52]:
df['age'][df['age'] > 50] 
# df[컬럼명][조건] 컬림이True인 것만 추출

0    100
Name: age, dtype: int64

In [10]:
df['ex']

0    1
1    2
Name: ex, dtype: int64

In [62]:
df.loc[0] # loc[행]

name    홍길동
age     100
ex        1
Name: 0, dtype: object

In [58]:
df.loc[ : , 'age'] # loc[행, 열]

0    100
1     30
Name: age, dtype: int64

In [11]:
df.describe() # 수치항목에 대해서만 요약
# 갯수, 평균(mean), 표준편차(std), 최소(min), 최대(max)
# 25%, 50%, 70%, 100%(사분위수)

              age        ex
count    2.000000  2.000000
mean    65.000000  1.500000
std     49.497475  0.707107
min     30.000000  1.000000
25%     47.500000  1.250000
50%     65.000000  1.500000
75%     82.500000  1.750000
max    100.000000  2.000000

In [63]:
df.dtypes

name    object
age      int64
ex       int64
dtype: object

In [64]:
df.name #컬럼만 추출하는 경우

0    홍길동
1    박길동
Name: name, dtype: object

In [66]:
df.loc[:,'name'] 
#행(인덱스(object, int) 이용), 열(컬럼명 이용)을 함께 추출하는 경우 loc함수
#행(인덱스 int이용), 열(인덱스 int이용)을 함께 추출하는 경우 iloc

0    홍길동
1    박길동
Name: name, dtype: object

In [67]:
df.loc[:,'name':'age']

  name  age
0  홍길동  100
1  박길동   30

In [68]:
df.loc[:,'name':'ex']

  name  age  ex
0  홍길동  100   1
1  박길동   30   2

In [69]:
df.loc[0] #0번 행

name    홍길동
age     100
ex        1
Name: 0, dtype: object

In [70]:
df.loc[1, ['name', 'ex']]

name    박길동
ex        2
Name: 1, dtype: object

In [71]:
df.loc[1:2, 'age':'ex']

   age  ex
1   30   2

In [72]:
df['add_column'] = df['age'] + df['ex'] 
# 기존의 컬럼에 새로운 컬럼 추가 가능(파생한다, 파생컬럼, 파생변수)
# df[새로 만들고 싶은 컬럼명] = df[기존 컬럼] + df[기존 컬럼]
df

  name  age  ex  add_column
0  홍길동  100   1         101
1  박길동   30   2          32

In [74]:
df['next_age'] = df['age'] + 1 # 내년 나이
df

  name  age  ex  add_column  next_age
0  홍길동  100   1         101       101
1  박길동   30   2          32        31

In [94]:
df.loc[0, 'name']

'홍길동'

In [76]:
df.iloc[0, 0]

'홍길동'

In [77]:
df.loc[0, 'add_column']

101

In [83]:
df.iloc[0, 3]
df.iloc[0, 3] = 200
df

  name  age  ex  add_column  next_age
0  홍길동  100   1         200       101
1  박길동   30   2          32        31

In [107]:
df.loc[1, 'next_age']

300

In [102]:
df.iloc[1, 4]

300

In [84]:
df.loc[1, 'next_age'] = 300
df

  name  age  ex  add_column  next_age
0  홍길동  100   1         200       101
1  박길동   30   2          32       300

In [88]:
df.columns

Index(['name', 'age', 'ex', 'add_column', 'next_age'], dtype='object')

In [89]:
df.index

RangeIndex(start=0, stop=2, step=1)

In [90]:
df.values #중요 ---> ndarray클래스
# n : 숫자(차원수, 1차원 1, 2차원 2 ....)
# d : 차원(dimension)
# array : 리스트
# 판다스에는 여러 차원의 데이터를 하나의 클래스로 처리하기 위해서
# 여러 차원의 데이터를 다룰 수 있는 ndarray를 만들어 놓았음

array([['홍길동', 100, 1, 200, 101],
       ['박길동', 30, 2, 32, 300]], dtype=object)

In [15]:
name_list = []
age_list = []
ex_list = []
for i in range(1000):
    name_list.append('이름' + str(i))
    age_list.append(random.randint(1,120))
    ex_list.append(random.randint(1,2))
len(name_list), len(age_list), len(ex_list)

(1000, 1000, 1000)

In [16]:
name_list[:5] # index 0~4, 5개를 print

['이름0', '이름1', '이름2', '이름3', '이름4']

In [18]:
name_list[995:]

['이름995', '이름996', '이름997', '이름998', '이름999']

In [19]:
ex_list[:5]

[1, 2, 2, 2, 1]

In [33]:
# 1. df로 만들어보고,
# 2. 데이터 타입을 확인
# 3. 각 컬럼을 추출
# 4. 숫자형 컬럼의 요약
df2 = pd.DataFrame({"name" : name_list,
                  "age" : age_list,
                  "ex" : ex_list
                   })

In [34]:
df2

      name  age  ex
0      이름0   45   1
1      이름1   89   2
2      이름2   54   2
3      이름3   78   2
4      이름4  108   1
..     ...  ...  ..
995  이름995   68   1
996  이름996    1   1
997  이름997   34   2
998  이름998   18   2
999  이름999   61   1

[1000 rows x 3 columns]

In [36]:
type(df2['name'])

pandas.core.series.Series

In [37]:
df2.dtypes # name : object(str), age(int64), ex(int64)

name    object
age      int64
ex       int64
dtype: object

In [39]:
df2['name'] # 데이터프레임[컬럼명] 
# 컬럼만 추출

0        이름0
1        이름1
2        이름2
3        이름3
4        이름4
       ...
995    이름995
996    이름996
997    이름997
998    이름998
999    이름999
Name: name, Length: 1000, dtype: object

In [40]:
df2.name # 컬럼만 추출

0        이름0
1        이름1
2        이름2
3        이름3
4        이름4
       ...
995    이름995
996    이름996
997    이름997
998    이름998
999    이름999
Name: name, Length: 1000, dtype: object

In [41]:
df2['age']

0       45
1       89
2       54
3       78
4      108
      ...
995     68
996      1
997     34
998     18
999     61
Name: age, Length: 1000, dtype: int64

In [42]:
df2['ex']

0      1
1      2
2      2
3      2
4      1
      ..
995    1
996    1
997    2
998    2
999    1
Name: ex, Length: 1000, dtype: int64

In [44]:
df2['age'] > 50 # 브로드캐스팅

0      False
1       True
2       True
3       True
4       True
       ...
995     True
996    False
997    False
998    False
999     True
Name: age, Length: 1000, dtype: bool

In [47]:
df2['age'] - 10 # 브로드캐스팅
# 원본을 가져다가 처리하므로, df2는 바뀌지 않음
# (비파괴 연산)

0      35
1      79
2      44
3      68
4      98
       ..
995    58
996    -9
997    24
998     8
999    51
Name: age, Length: 1000, dtype: int64

In [48]:
df2['age']

0       45
1       89
2       54
3       78
4      108
      ...
995     68
996      1
997     34
998     18
999     61
Name: age, Length: 1000, dtype: int64

In [49]:
df2['age'] = df2['age'] - 10
df2['age']

0      35
1      79
2      44
3      68
4      98
       ..
995    58
996    -9
997    24
998     8
999    51
Name: age, Length: 1000, dtype: int64

In [50]:
df2['name'] = df2['name'] + '님'
df2['name']

0        이름0님
1        이름1님
2        이름2님
3        이름3님
4        이름4님
        ...
995    이름995님
996    이름996님
997    이름997님
998    이름998님
999    이름999님
Name: name, Length: 1000, dtype: object

In [51]:
df2.describe()

               age           ex
count  1000.000000  1000.000000
mean     51.045000     1.483000
std      34.391623     0.499961
min      -9.000000     1.000000
25%      21.000000     1.000000
50%      52.000000     1.000000
75%      82.000000     2.000000
max     110.000000     2.000000